LEXICON_COMMANDS_MENU = {
    '/start': 'Запуск бота',
    '/help': 'Помощь',
    '/play_with_bot': 'Начать игру с ботом',
    '/play_with_human': 'Найти противника для игры',
    '/statistic': 'Показать статистику',
    '/cancel': 'Выход в меню',
}

LEXICON_HANDLER_COMMANDS = {
    '/start': 'Привет, я бот для игры в шахматы.\n'
              'Я нахожусь в супербетном бетатесте, так что не суди строго.\n'
              'Для получения справки напиши /help, или выбери команду в меню.',
    '/help': 'Правила для игры стандартные.\n'
             'Команды и их описание доступны в меню.\n'
             'Из-за невозможности добавить эмодзи шахмат разного цвета(я их не нашел), используются приписки "B"(Black) - у черных, "W"(White) - у белых.\n'
             'По поводу неточностей и дополнений пишите сюда: @telejkatupa',
    '/statistic': 'Ваша статистика:\n',
    '/cancel': 'Если захотите сыграть, пишите',
}

LEXICON_FIGURES = {
    'p': 'B♙',
    'P': 'W♙',
    'r': 'B♜',
    'R': 'W♖',
    'n': 'B♞',
    'N': 'W♘',
    'b': 'B♝',
    'B': 'W♗',
    'q': 'B♛',
    'Q': 'W♕',
    'k': 'B♚',
    'K': 'W♔',
    0: '⬜',
    1: '⬛'
}
